Tekla.Structures.Geometry3d.FacetedBrepFaceHole
The FacetedBrepFaceHole class defines a hole on a faceted BREP face.
A FacetedBrepFaceHole cannot be instantiated directly. They are managed internally by a FacetedBrepFace.
You can look also at the code example for the class FacetedBrepFace to see more examples.
using System.Linq;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
FacetedBrep brep = SomeFunctionThatReturnFacetedBrep();
foreach (FacetedBrepFace face in brep.Faces.Where(x => x.HasHoles))
{
foreach (FacetedBrepFaceHole hole in face.Holes)
{
foreach (Vector vertex in hole.Vertices)
{
Console.WriteLine("Hole point x:{0} y:{1} z:{2}", vertex.X, vertex.Y, vertex.Z);
}
}
}
}
}

Tekla.Structures.Geometry3d.FacetedBrepFaceHole.Count
Gets the count;

Tekla.Structures.Geometry3d.FacetedBrepFaceHole.IsReadOnly
Gets a value indicating whether this instance is read only.

Tekla.Structures.Geometry3d.FacetedBrepFaceHole.VerticeIndexes
Gets the vertice indexes.

Tekla.Structures.Geometry3d.FacetedBrepFaceHole.Vertices
Gets the vertices.